In [2]:
import json
import pandas as pd
import numpy as np
import geopandas as gpd
import matplotlib.pyplot as plt

from sqlalchemy import create_engine
pd.set_option('display.max_columns', 100)
pd.set_option('display.max_rows', 100)

## Connect to PG

In [3]:
engine = create_engine('postgresql://postgres:root@localhost:5432/potrace_db')

## Initialize Data

In [ ]:
def summarise(df, key, pivot_column, value_column, function):
    if function == 'mean':
        dasbor = df.groupby(pivot_column)[[value_column]].mean().reset_index()
        val = dasbor[value_column].to_list()
        val.append(df[value_column].mean())
        val = [ round(elem, 2) for elem in val ]
    
    if function == 'sum':
        dasbor = df.groupby(pivot_column)[[value_column]].sum().reset_index()
        val = dasbor[value_column].to_list()
        val.append(df[value_column].sum())
        val = [ round(elem, 2) for elem in val ]

    if function == 'count':
        dasbor = df.groupby(pivot_column)[[value_column]].count().reset_index()
        val = dasbor[value_column].to_list()
        val.append(df[value_column].count())

    if function == 'unique':
        dasbor = df.groupby(pivot_column)[[value_column]].nunique().reset_index()
        val = dasbor[value_column].to_list()
        val.append(df[value_column].nunique())

    district_id = dasbor[pivot_column].to_list()
    district_id.append("")
    dict = {'district_id': district_id, 'value': val} 
    dasbor_all = pd.DataFrame(dict)
    n = len(dasbor_all)
    dasbor_all.insert(0, "id", [i for i in range(n)], True)
    dasbor_all.insert(2, "key", [key for i in range(n)], True)
    dasbor_all.insert(3, "category", ["" for i in range(n)], True)
    dasbor_all["created_at"] = pd.Timestamp.now().strftime('%Y-%m-%d %H:%M:%S')
    dasbor_all["updated_at"] = pd.Timestamp.now().strftime('%Y-%m-%d %H:%M:%S')
    return(dasbor_all)

### Farmers

In [4]:
q1 = "SELECT * FROM farmers;"
farmers = pd.read_sql_query(q1, engine)
farmers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 304 entries, 0 to 303
Data columns (total 46 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   id                  304 non-null    int64
 1   username            304 non-null    object
 2   interName           304 non-null    object
 3   surveyDate          304 non-null    object
 4   farmerName          304 non-null    object
 5   farmer_phone        304 non-null    object
 6   district_id         304 non-null    object
 7   sub_district_id     304 non-null    object
 8   village_id          304 non-null    object
 9   farmerGender        304 non-null    object
 10  farmerAge           304 non-null    int64
 11  size                304 non-null    int64
 12  dependents          304 non-null    int64
 13  education           304 non-null    object
 14  origin              304 non-null    object
 15  ethnic              304 non-null    object
 16  main_occupation     304 non-null    object
 17  side_occupation     285 non-null    object
 18  sideOther           65 non-null     object
 19  income_oilpalm      304 non-null    int64
 20  income_nonoilpalm   304 non-null    int64
 21  ownership           304 non-null    int64
 22  number_plot         304 non-null    int64
 23  area_plot           304 non-null    float64
 24  joinGroup           304 non-null    object
 25  groupName           139 non-null    object
 26  groupBenefit        139 non-null    object
 27  permit              304 non-null    object
 28  no_permit           144 non-null    object
 29  seed_paper          304 non-null    object
 30  no_seed             62 non-null     object
 31  acquisition         304 non-null    object
 32  who                 304 non-null    object
 33  whoother            9 non-null      object
 34  yearOwned           304 non-null    int64
 35  landUse             304 non-null    object
 36  activities          304 non-null    object
 37  women               304 non-null    object
 38  women_activities    181 non-null    object
 39  sell_FFB            304 non-null    object
 40  price               304 non-null    object
 41  factor              304 non-null    object
 42  submission_time     304 non-null    datetime64[ns]
 43  created_at          304 non-null    datetime64[ns]
 44  updated_at          304 non-null    datetime64[ns]
 45  kobo_connection_id  304 non-null    object
dtypes: datetime64[ns](3), float64(1), int64(9), object(33)
memory usage: 109.4+ KB

In [5]:
df_farmers = farmers.copy()

### Farms

In [6]:
q2 = "SELECT * FROM farms;"
farms = pd.read_sql_query(q2, engine)
farms.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 312 entries, 0 to 311
Data columns (total 41 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   id                  312 non-null    int64
 1   username            312 non-null    object
 2   interName           312 non-null    object
 3   surveyDate          312 non-null    object
 4   farmerName          312 non-null    object
 5   farmer_phone        312 non-null    object
 6   ownership           312 non-null    int64
 7   ownerName           312 non-null    object
 8   owner_phone         312 non-null    object
 9   district_id         312 non-null    object
 10  sub_district_id     312 non-null    object
 11  village_id          312 non-null    object
 12  address             204 non-null    object
 13  plant_age           312 non-null    float64
 14  plant_areaDoc       312 non-null    float64
 15  plant_doc           312 non-null    object
 16  plant_category      312 non-null    object
 17  seedcert            312 non-null    object
 18  seedsource          312 non-null    object
 19  seedsourceother     30 non-null     object
 20  seed_invoice        312 non-null    object
 21  yield_minKG         312 non-null    float64
 22  yield_maxKG         312 non-null    float64
 23  yield_meanKG        312 non-null    float64
 24  yield_meanTon       312 non-null    float64
 25  harvest_period      312 non-null    int64
 26  harvest_freqYear    312 non-null    float64
 27  plant_production    312 non-null    float64
 28  plant_productivity  312 non-null    float64
 29  millsNumber         312 non-null    int64
 30  plant_point         312 non-null    object
 31  plant_polygon       312 non-null    object
 32  plant_polyAreaM2    312 non-null    float64
 33  plant_polyAreaHa    312 non-null    float64
 34  percent_difArea     312 non-null    float64
 35  image_url           312 non-null    object
 36  submission_time     312 non-null    datetime64[ns]
 37  created_at          312 non-null    datetime64[ns]
 38  updated_at          312 non-null    datetime64[ns]
 39  kobo_connection_id  312 non-null    object
 40  plant_docOthers     2 non-null      object
dtypes: datetime64[ns](3), float64(12), int64(4), object(22)
memory usage: 100.1+ KB

In [54]:
q3 = "SELECT * FROM farm_mills;"
farm_mills = pd.read_sql_query(q3, engine)
q4 = "SELECT id, district_id FROM mills;"
mills = pd.read_sql_query(q4, engine)
farm_mills.drop(columns="id", inplace=True)

In [68]:
df_merged = farm_mills.merge(df_farms[["id", "district_id"]], left_on="farm_id", right_on="id", how="left").drop(columns=["created_at", "updated_at"])
df_merged = df_merged[["farm_id", "mill_id", "district_id"]].merge(mills, left_on=["mill_id", "district_id"], right_on=["id", "district_id"], how="left")
df_merged

     farm_id       mill_id district_id            id
0      13928  PO1000008233      ID6403  PO1000008233
1      13928  PO1000014622      ID6403  PO1000014622
2      13928  PO1000001488      ID6403  PO1000001488
3      13930  PO1000008233      ID6403  PO1000008233
4      13931  PO1000008233      ID6403  PO1000008233
..       ...           ...         ...           ...
393    20391  PO1000008148      ID6107  PO1000008148
394    20392  PO1000007642      ID6107  PO1000007642
395    20392  PO1000008148      ID6107  PO1000008148
396    20394  PO1000007642      ID6107  PO1000007642
397    20394  PO1000008148      ID6107  PO1000008148

[398 rows x 4 columns]

### Plantation area

In [7]:
df_farms = farms.copy()

In [8]:
dasbor_luas_kebun = df_farms.groupby('district_id')[['plant_areaDoc']].sum().reset_index()
dasbor_luas_kebun

  district_id  plant_areaDoc
0      ID6107         220.58
1      ID6403         146.18

In [9]:
val = dasbor_luas_kebun['plant_areaDoc'].to_list()
val.append(df_farms['plant_areaDoc'].sum())
val

[220.58, 146.18, 366.76]

In [10]:
district_id = dasbor_luas_kebun['district_id'].to_list()
district_id.append("")
district_id

['ID6107', 'ID6403', '']

In [11]:
dict = {'district_id': district_id, 'value': val} 
dasbor_all_luas_kebun = pd.DataFrame(dict)
dasbor_all_luas_kebun

  district_id   value
0      ID6107  220.58
1      ID6403  146.18
2              366.76

In [12]:
n = len(dasbor_all_luas_kebun)
dasbor_all_luas_kebun.insert(0, "id", [i for i in range(n)], True)
dasbor_all_luas_kebun.insert(2, "key", ["plant_area" for i in range(n)], True)
dasbor_all_luas_kebun.insert(3, "category", ["" for i in range(n)], True)
dasbor_all_luas_kebun["created_at"] = pd.Timestamp.now().strftime('%Y-%m-%d %H:%M:%S')
dasbor_all_luas_kebun["updated_at"] = pd.Timestamp.now().strftime('%Y-%m-%d %H:%M:%S')

In [73]:
dasbor_all_luas_kebun = summarise(df_farms, 'plant_area', 'district_id', 'plant_areaDoc', 'sum')
dasbor_all_luas_kebun

,id,district_id,key,category,value,created_at,updated_at
0,0,ID6107,plant_area,,220.58,2024-09-24 11:28:07,2024-09-24 11:28:07
1,1,ID6403,plant_area,,146.18,2024-09-24 11:28:07,2024-09-24 11:28:07
2,2,,plant_area,,366.76,2024-09-24 11:28:07,2024-09-24 11:28:07

### Plant production

In [74]:
dasbor_all_produksi_tanaman = summarise(df_farms, 'plant_production', 'district_id', 'plant_production', 'sum')
dasbor_all_produksi_tanaman

,id,district_id,key,category,value,created_at,updated_at
0,0,ID6107,plant_production,,52033.39,2024-09-24 11:29:43,2024-09-24 11:29:43
1,1,ID6403,plant_production,,2605.57,2024-09-24 11:29:43,2024-09-24 11:29:43
2,2,,plant_production,,54638.96,2024-09-24 11:29:43,2024-09-24 11:29:43

### Plant productivity

In [23]:
dasbor_all_produktifitas_tanaman = summarise(df_farms, 'plant_productivity', 'district_id', 'plant_productivity', 'mean')
dasbor_all_produktifitas_tanaman

,id,district_id,key,category,value,created_at,updated_at
0,0,ID6107,plant_productivity,,156.395561,2024-09-24 09:47:07,2024-09-24 09:47:07
1,1,ID6403,plant_productivity,,21.859720,2024-09-24 09:47:07,2024-09-24 09:47:07
2,2,,plant_productivity,,110.256667,2024-09-24 09:47:07,2024-09-24 09:47:07

### Smallhoder farmer

In [27]:
dasbor_all_farmer = summarise(df_farms, 'smallholder_farmer', 'district_id', 'plant_productivity', 'count')
dasbor_all_farmer

,id,district_id,key,category,value,created_at,updated_at
0,0,ID6107,smallholder_farmer,,205,2024-09-24 09:57:56,2024-09-24 09:57:56
1,1,ID6403,smallholder_farmer,,107,2024-09-24 09:57:56,2024-09-24 09:57:56
2,2,,smallholder_farmer,,312,2024-09-24 09:57:56,2024-09-24 09:57:56

### Plant age

In [33]:
dasbor_plant_age = df_farms.groupby('district_id')[['plant_age']].mean().reset_index()
val = dasbor_plant_age['plant_age'].to_list()
val.append(df_farms['plant_age'].mean())
val = [ round(elem, 2) for elem in val ]
val

[9.7, 10.79, 10.07]

In [35]:
dasbor_all_plant_age = summarise(df_farms, 'plant_age', 'district_id', 'plant_age', 'mean')
dasbor_all_plant_age

,id,district_id,key,category,value,created_at,updated_at
0,0,ID6107,plant_age,,9.70,2024-09-24 10:03:56,2024-09-24 10:03:56
1,1,ID6403,plant_age,,10.79,2024-09-24 10:03:56,2024-09-24 10:03:56
2,2,,plant_age,,10.07,2024-09-24 10:03:56,2024-09-24 10:03:56

### Mills Linked

In [70]:
dasbor_all_mill = summarise(df_merged, 'mills_linked', 'district_id', 'mill_id', 'unique')
dasbor_all_mill

,id,district_id,key,category,value,created_at,updated_at
0,0,ID6107,mills_linked,,5,2024-09-24 11:18:39,2024-09-24 11:18:39
1,1,ID6403,mills_linked,,9,2024-09-24 11:18:39,2024-09-24 11:18:39
2,2,,mills_linked,,14,2024-09-24 11:18:39,2024-09-24 11:18:39

In [75]:
df_list = [dasbor_all_luas_kebun, dasbor_all_produksi_tanaman, dasbor_all_farmer, dasbor_all_produktifitas_tanaman, dasbor_all_plant_age, dasbor_all_mill]
res = pd.concat(df_list, ignore_index=True)
res['id'] = [i+1 for i in range(len(res))]
res

,id,district_id,key,category,value,created_at,updated_at
0,0,ID6107,plant_area,,220.580000,2024-09-24 11:28:07,2024-09-24 11:28:07
1,1,ID6403,plant_area,,146.180000,2024-09-24 11:28:07,2024-09-24 11:28:07
2,2,,plant_area,,366.760000,2024-09-24 11:28:07,2024-09-24 11:28:07
3,0,ID6107,plant_production,,52033.390000,2024-09-24 11:29:43,2024-09-24 11:29:43
4,1,ID6403,plant_production,,2605.570000,2024-09-24 11:29:43,2024-09-24 11:29:43
5,2,,plant_production,,54638.960000,2024-09-24 11:29:43,2024-09-24 11:29:43
6,0,ID6107,smallholder_farmer,,205.000000,2024-09-24 09:57:56,2024-09-24 09:57:56
7,1,ID6403,smallholder_farmer,,107.000000,2024-09-24 09:57:56,2024-09-24 09:57:56
8,2,,smallholder_farmer,,312.000000,2024-09-24 09:57:56,2024-09-24 09:57:56
9,0,ID6107,plant_productivity,,156.395561,2024-09-24 09:47:07,2024-09-24 09:47:07
10,1,ID6403,plant_productivity,,21.859720,2024-09-24 09:47:07,2024-09-24 09:47:07
11,2,,plant_productivity,,110.256667,2024-09-24 09:47:07,2024-09-24 09:47:07
12,0,ID6107,plant_age,,9.700000,2024-09-24 10:03:56,2024-09-24 10:03:56
13,1,ID6403,plant_age,,10.790000,2024-09-24 10:03:56,2024-09-24 10:03:56
14,2,,plant_age,,10.070000,2024-09-24 10:03:56,2024-09-24 10:03:56
15,0,ID6107,mills_linked,,5.000000,2024-09-24 11:18:39,2024-09-24 11:18:39
16,1,ID6403,mills_linked,,9.000000,2024-09-24 11:18:39,2024-09-24 11:18:39
17,2,,mills_linked,,14.000000,2024-09-24 11:18:39,2024-09-24 11:18:39

In [78]:
res['id'] = [i+1 for i in range(len(res))]
res

,id,district_id,key,category,value,created_at,updated_at
0,1,ID6107,plant_area,,220.580000,2024-09-24 11:28:07,2024-09-24 11:28:07
1,2,ID6403,plant_area,,146.180000,2024-09-24 11:28:07,2024-09-24 11:28:07
2,3,,plant_area,,366.760000,2024-09-24 11:28:07,2024-09-24 11:28:07
3,4,ID6107,plant_production,,52033.390000,2024-09-24 11:29:43,2024-09-24 11:29:43
4,5,ID6403,plant_production,,2605.570000,2024-09-24 11:29:43,2024-09-24 11:29:43
5,6,,plant_production,,54638.960000,2024-09-24 11:29:43,2024-09-24 11:29:43
6,7,ID6107,smallholder_farmer,,205.000000,2024-09-24 09:57:56,2024-09-24 09:57:56
7,8,ID6403,smallholder_farmer,,107.000000,2024-09-24 09:57:56,2024-09-24 09:57:56
8,9,,smallholder_farmer,,312.000000,2024-09-24 09:57:56,2024-09-24 09:57:56
9,10,ID6107,plant_productivity,,156.395561,2024-09-24 09:47:07,2024-09-24 09:47:07
10,11,ID6403,plant_productivity,,21.859720,2024-09-24 09:47:07,2024-09-24 09:47:07
11,12,,plant_productivity,,110.256667,2024-09-24 09:47:07,2024-09-24 09:47:07
12,13,ID6107,plant_age,,9.700000,2024-09-24 10:03:56,2024-09-24 10:03:56
13,14,ID6403,plant_age,,10.790000,2024-09-24 10:03:56,2024-09-24 10:03:56
14,15,,plant_age,,10.070000,2024-09-24 10:03:56,2024-09-24 10:03:56
15,16,ID6107,mills_linked,,5.000000,2024-09-24 11:18:39,2024-09-24 11:18:39
16,17,ID6403,mills_linked,,9.000000,2024-09-24 11:18:39,2024-09-24 11:18:39
17,18,,mills_linked,,14.000000,2024-09-24 11:18:39,2024-09-24 11:18:39

In [79]:
res.to_sql('data_analytics', engine, if_exists='replace', index=False)

18